https://Daniellem97.app.spacelift.io/stack/stack_number_4/run/01JVCMYAY5DFX7X6TXSF6VKXVB has finished

## Planning logs

```
[01JV7FBMZS94V7V7JD7G28V27B] Planning changes with 0 custom hooks...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # spacelift_stack.stack-1 will be created
  + resource "spacelift_stack" "stack-1" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 1"
      + project_root                     = "stack-a"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-2 will be created
  + resource "spacelift_stack" "stack-2" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 2"
      + project_root                     = "stack-b"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-3 will be created
  + resource "spacelift_stack" "stack-3" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 3"
      + project_root                     = "stack-c"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack_dependency.dependency will be created
  + resource "spacelift_stack_dependency" "dependency" {
      + depends_on_stack_id = (known after apply)
      + id                  = (known after apply)
      + stack_id            = (known after apply)
    }

  # spacelift_stack_dependency_reference.reference will be created
  + resource "spacelift_stack_dependency_reference" "reference" {
      + id                  = (known after apply)
      + input_name          = "TF_VAR_APP_DB_URL"
      + output_name         = "DB_CONNECTION_STRING"
      + stack_dependency_id = (known after apply)
      + trigger_always      = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

[01JV7FBMZS94V7V7JD7G28V27B] Changes are GO
[01JV7FBMZS94V7V7JD7G28V27B] Uploading the list of managed resources...
[01JV7FBMZS94V7V7JD7G28V27B] Please be aware that the run changes calculation includes output changes.
[01JV7FBMZS94V7V7JD7G28V27B] Resource list upload is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating JSON representation of the plan...
[01JV7FBMZS94V7V7JD7G28V27B] JSON representation is GO
[01JV7FBMZS94V7V7JD7G28V27B] Loading custom plan policy inputs...
[01JV7FBMZS94V7V7JD7G28V27B] 0 custom plan policy inputs found
[01JV7FBMZS94V7V7JD7G28V27B] No plan policies to evaluate
```
